mbarbeau0545/Stm32PrjTpl/src/1_FMK/FMK_HAL/FKM_IO/Src/FMK_IO.c
/*********************************************************************
 * @file        FMKIO.c
 * @brief       Template_BriefDescription.
 * @details     TemplateDetailsDescription.\n
 *
 * @author      xxxxxx
 * @date        jj/mm/yyyy
 * @version     1.0
 */

// ********************************************************************
// *                      Includes
// ********************************************************************

#include "stm32f0xx_hal.h"
#include "./FMK_IO.h"
#include "FMK_CFG/FMKCFG_ConfigFiles/FMKIO_ConfigPrivate.h"
#include "FMK_HAL/FMK_CDA/Src/FMK_CDA.h"

// ********************************************************************
// *                      Defines
// ********************************************************************
#define FMKIO_AF_UNUSED ((t_uint8)0xFF)
// ********************************************************************
// *                      Types
// ********************************************************************
//-----------------------------ENUM TYPES-----------------------------//
/* CAUTION : Automatic generated code section for Enum: Start */

/* CAUTION : Automatic generated code section for Enum: End */

//-----------------------------TYPEDEF TYPES---------------------------//
//-----------------------------STRUCT TYPES---------------------------//
/* CAUTION : Automatic generated code section for Structure: Start */

/* CAUTION : Automatic generated code section for Structure: End */
typedef struct
{
    t_eFMKIO_PullMode pull_e;
    t_eFMKIO_SpdMode spd_e;
    t_eFMKIO_AlternateFunc altFunc_e;
    t_bool IsSigConfigured_b;
    t_bool IsInterruptEnable_b;
    t_cbFMKIO_EventFunc *EvntFunc_cb;

} t_sFMKIO_SigInfo;
// ********************************************************************
// *                      Prototypes
// ********************************************************************

// ********************************************************************
// *                      Variables
// ********************************************************************
t_sFMKIO_SigInfo g_InFreqSigInfo_as[FMKIO_INPUT_SIGFREQ_NB];
t_sFMKIO_SigInfo g_InAnaSigInfo_as[FMKIO_INPUT_SIGANA_NB];
t_sFMKIO_SigInfo g_InDigSigInfo_as[FMKIO_INPUT_SIGDIG_NB];
t_sFMKIO_SigInfo g_InEvntSigInfo_as[FMKIO_INPUT_SIGEVNT_NB];
t_sFMKIO_SigInfo g_OutPwmSigInfo_as[FMKIO_OUTPUT_SIGPWM_NB];
t_sFMKIO_SigInfo g_OutDigSigInfo_as[FMKIO_OUTPUT_SIGDIG_NB];

t_eFMKCPU_ClockPortOpe g_IsGpioClockEnable_ae[FMKIO_GPIO_PORT_NB] = {
    FMKCPU_CLOCKPORT_OPE_DISABLE, // FMKIO_GPIO_PORT_A
    FMKCPU_CLOCKPORT_OPE_DISABLE, // FMKIO_GPIO_PORT_B
    FMKCPU_CLOCKPORT_OPE_DISABLE, // FMKIO_GPIO_PORT_C
    FMKCPU_CLOCKPORT_OPE_DISABLE, // FMKIO_GPIO_PORT_D
    FMKCPU_CLOCKPORT_OPE_DISABLE, // FMKIO_GPIO_PORT_F
};

t_uint32 g_InFreqSigRawValue_ua32[FMKIO_INPUT_SIGFREQ_NB];
static t_eCyclicFuncState g_state_e = STATE_CYCLIC_WAITING;
//********************************************************************************
//                      Local functions - Prototypes
//********************************************************************************
/*****************************************************************************
 *
 *	@brief
 *	@details
 *
 *
 *	@param[in]
 *	@param[out]
 *
 *
 *
 */
static t_eReturnState s_FMKIO_Get_BspPullMode(t_eFMKIO_PullMode f_pull_e, t_uint32 *f_bspPull_pu32);
/*****************************************************************************
 *
 *	@brief
 *	@details
 *
 *
 *	@param[in]
 *	@param[out]
 *
 *
 *
 */
static t_eReturnState s_FMKIO_Get_BspSpdMode(t_eFMKIO_SpdMode f_spd_e, t_uint32 *f_bspSpd_pu32);
/*****************************************************************************
 *
 *	@brief
 *	@details
 *
 *
 *	@param[in]
 *	@param[out]
 *
 *
 *
 */
static t_eReturnState s_FMKIO_Get_BspGpioPort(t_eFMKIO_GpioPort f_GpioPort_e, GPIO_TypeDef **f_BspGpio_ps);
/*****************************************************************************
 *
 *	@brief
 *	@details
 *
 *
 *	@param[in]
 *	@param[out]
 *
 *
 *
 */
static t_eReturnState s_FMKIO_Get_BspTriggerMode(t_eFMKIO_SigTrigCptr f_trigger_e, t_uint32 *f_bspTrigger_pu32);
/*****************************************************************************
 *
 *	@brief
 *	@details
 *
 *
 *	@param[in]
 *	@param[out]
 *
 *
 *
 */
static t_eReturnState s_FMKIO_Set_BspSigCfg(t_eFMKIO_GpioPort f_gpioPort_e,
                                            t_eFMKIO_BspGpioPin f_pin_e,
                                            t_uint32 f_mode_u32,
                                            t_eFMKIO_PullMode f_pull_e,
                                            t_eFMKIO_SpdMode f_spd_e,
                                            t_uint8 f_AltFunc_u8);
/*****************************************************************************
 *
 *	@brief
 *	@details
 *
 *
 *	@param[in]
 *	@param[out]
 *
 *
 *
 */
static t_eReturnState s_FMKIO_MngSigFrequency(t_eFMKCPU_Timer f_timer_e, t_eFMKCPU_InterruptChnl f_channel_e);
/**************************************************************************************
 *
 *	@brief
 *	@details
 *
 *
 *	@param[in]
 *	@param[out]
 *
 *
 *
 */
static t_eReturnState s_FMKIO_Set_GpioClkState(t_eFMKIO_GpioPort f_gpioPort_e, t_eFMKCPU_ClockPortOpe f_ope_e);
/**************************************************************************************
 *
 *	@brief
 *	@details
 *
 *
 *	@param[in]
 *	@param[out]
 *
 *
 *
 */
static t_eReturnState s_FMKIO_Operational(void);
//****************************************************************************
//                      Public functions - Implementation
//********************************************************************************
/*********************************
 * FMKCPU_Init
 *********************************/
t_eReturnState FMKIO_Init(void)
{
    t_uint8 LLI_u8;
    
    for(LLI_u8 = (t_uint8)0 ; LLI_u8 < (t_uint8)FMKIO_INPUT_SIGFREQ_NB ; LLI_u8++)
    {
        g_InFreqSigRawValue_ua32[LLI_u8] = (t_uint32)0;
        g_InFreqSigInfo_as[LLI_u8].altFunc_e = FMKIO_AF_NB;
        g_InFreqSigInfo_as[LLI_u8].EvntFunc_cb = NULL;
        g_InFreqSigInfo_as[LLI_u8].IsInterruptEnable_b = False;
        g_InFreqSigInfo_as[LLI_u8].IsSigConfigured_b   = False;
        g_InFreqSigInfo_as[LLI_u8].pull_e = FMKIO_PULL_MODE_UNABLE;
        g_InFreqSigInfo_as[LLI_u8].spd_e = FMKIO_SPD_MODE_MEDIUM;
    }
    for(LLI_u8 = (t_uint8)0 ; LLI_u8 < (t_uint8)FMKIO_INPUT_SIGANA_NB ; LLI_u8++)
    {
        g_InAnaSigInfo_as[LLI_u8].altFunc_e = FMKIO_AF_NB;
        g_InAnaSigInfo_as[LLI_u8].EvntFunc_cb = NULL;
        g_InAnaSigInfo_as[LLI_u8].IsInterruptEnable_b = False;
        g_InAnaSigInfo_as[LLI_u8].IsSigConfigured_b   = False;
        g_InAnaSigInfo_as[LLI_u8].pull_e = FMKIO_PULL_MODE_UNABLE;
        g_InAnaSigInfo_as[LLI_u8].spd_e = FMKIO_SPD_MODE_MEDIUM;
    }
    for(LLI_u8 = (t_uint8)0 ; LLI_u8 < (t_uint8)FMKIO_INPUT_SIGDIG_NB ; LLI_u8++)
    {
        g_InDigSigInfo_as[LLI_u8].altFunc_e = FMKIO_AF_NB;
        g_InDigSigInfo_as[LLI_u8].EvntFunc_cb = NULL;
        g_InDigSigInfo_as[LLI_u8].IsInterruptEnable_b = False;
        g_InDigSigInfo_as[LLI_u8].IsSigConfigured_b   = False;
        g_InDigSigInfo_as[LLI_u8].pull_e = FMKIO_PULL_MODE_UNABLE;
        g_InDigSigInfo_as[LLI_u8].spd_e = FMKIO_SPD_MODE_MEDIUM;
    }
    for(LLI_u8 = (t_uint8)0 ; LLI_u8 < (t_uint8)FMKIO_INPUT_SIGEVNT_NB ; LLI_u8++)
    {
        g_InEvntSigInfo_as[LLI_u8].altFunc_e = FMKIO_AF_NB;
        g_InEvntSigInfo_as[LLI_u8].EvntFunc_cb = NULL;
        g_InEvntSigInfo_as[LLI_u8].IsInterruptEnable_b = False;
        g_InEvntSigInfo_as[LLI_u8].IsSigConfigured_b   = False;
        g_InEvntSigInfo_as[LLI_u8].pull_e = FMKIO_PULL_MODE_UNABLE;
        g_InEvntSigInfo_as[LLI_u8].spd_e = FMKIO_SPD_MODE_MEDIUM;
    }
    for(LLI_u8 = (t_uint8)0 ; LLI_u8 < (t_uint8)FMKIO_OUTPUT_SIGPWM_NB ; LLI_u8++)
    {
        g_OutPwmSigInfo_as[LLI_u8].altFunc_e = FMKIO_AF_NB;
        g_OutPwmSigInfo_as[LLI_u8].EvntFunc_cb = NULL;
        g_OutPwmSigInfo_as[LLI_u8].IsInterruptEnable_b = False;
        g_OutPwmSigInfo_as[LLI_u8].IsSigConfigured_b   = False;
        g_OutPwmSigInfo_as[LLI_u8].pull_e = FMKIO_PULL_MODE_UNABLE;
        g_OutPwmSigInfo_as[LLI_u8].spd_e = FMKIO_SPD_MODE_MEDIUM;
    }
    for(LLI_u8 = (t_uint8)0 ; LLI_u8 < (t_uint8)FMKIO_OUTPUT_SIGDIG_NB ; LLI_u8++)
    {
        g_OutDigSigInfo_as[LLI_u8].altFunc_e = FMKIO_AF_NB;
        g_OutDigSigInfo_as[LLI_u8].EvntFunc_cb = NULL;
        g_OutDigSigInfo_as[LLI_u8].IsInterruptEnable_b = False;
        g_OutDigSigInfo_as[LLI_u8].IsSigConfigured_b   = False;
        g_OutDigSigInfo_as[LLI_u8].pull_e = FMKIO_PULL_MODE_UNABLE;
        g_OutDigSigInfo_as[LLI_u8].spd_e = FMKIO_SPD_MODE_MEDIUM;
    }

