mbarbeau0545/Stm32PrjTpl/src/1_FMK/FMK_HAL/FKM_IO/Src/FMK_IO.c
    return RC_OK;
}
/*********************************
 * FMKIO_Cyclic
 *********************************/
t_eReturnState FMKIO_Cyclic(void)
{
    t_eReturnState Ret_e = RC_OK;

    switch (g_state_e)
    {
    case STATE_CYCLIC_WAITING:
    {
        // nothing to do, just wait all module are Ope
        break;
    }
    case STATE_CYCLIC_OPE:
    {
        Ret_e = s_FMKIO_Operational();
        break;
    }
    case STATE_CYCLIC_ERROR:
    {
        break;
    }
    case STATE_CYCLIC_PREOPE:
    case STATE_CYCLIC_BUSY:
    default:
        Ret_e = RC_OK;
        break;
    }
    return Ret_e;
}

/*********************************
 * FMKIO_GetState
 *********************************/
t_eReturnState FMKIO_GetState(t_eCyclicFuncState *f_State_pe)
{
    t_eReturnState Ret_e = RC_OK;
    
    if(f_State_pe == (t_eCyclicFuncState *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        *f_State_pe = g_state_e;
    }

    return Ret_e;
}

/*********************************
 * FMKIO_SetState
 *********************************/
t_eReturnState FMKIO_SetState(t_eCyclicFuncState f_State_e)
{
    g_state_e = f_State_e;
    return RC_OK;
}
/*********************************
 * s_FMKIO_Get_BspPullMode
 *********************************/
t_eReturnState FMKIO_Set_InDigSigCfg(t_eFMKIO_InDigSig f_signal_e, t_eFMKIO_PullMode f_pull_e)
{
    t_eReturnState Ret_e = RC_OK;
    t_eFMKIO_GpioPort gpioPort_e;
    if (f_signal_e > FMKIO_INPUT_SIGDIG_NB || f_pull_e > FMKIO_PULL_MODE_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if (Ret_e == RC_OK)
    {
        gpioPort_e = c_InDigSigBspMap_as[f_signal_e].HwGpio_e;
        Ret_e = s_FMKIO_Set_BspSigCfg(gpioPort_e,
                                      c_InDigSigBspMap_as[f_signal_e].HwPin_e,
                                      (t_uint32)MODE_INPUT,
                                      f_pull_e,
                                      FMKIO_SPD_MODE_LOW, // irrevelent for a input sig dig
                                      FMKIO_AF_UNUSED);
        if (Ret_e == RC_OK)
        {
            g_InDigSigInfo_as[f_signal_e].IsSigConfigured_b = (t_bool)True;
            g_InDigSigInfo_as[f_signal_e].pull_e = f_pull_e;
            g_InDigSigInfo_as[f_signal_e].spd_e = FMKIO_SPD_MODE_LOW;
        }
    }
    return Ret_e;
}

/*********************************
 * FMKIO_Set_InAnaSigCfg
 *********************************/
t_eReturnState FMKIO_Set_InAnaSigCfg(t_eFMKIO_InAnaSig f_signal_e, t_eFMKIO_PullMode f_pull_e)
{
    t_eReturnState Ret_e = RC_OK;
    t_eFMKIO_GpioPort gpioPort_e;
    if (f_signal_e > FMKIO_INPUT_SIGANA_NB || f_pull_e > FMKIO_PULL_MODE_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if (Ret_e == RC_OK)
    {
        gpioPort_e = c_InAnaSigBspMap_as[f_signal_e].HwGpio_e;
        Ret_e = s_FMKIO_Set_BspSigCfg(gpioPort_e,
                                      c_InAnaSigBspMap_as[f_signal_e].HwPin_e,
                                      (t_uint32)MODE_ANALOG,
                                      f_pull_e,
                                      FMKIO_SPD_MODE_LOW, // irrevelent for a input sig dig
                                      FMKIO_AF_UNUSED);
        if (Ret_e == RC_OK)
        { // configure the adc
            Ret_e = FMKCDA_Set_AdcChannelCfg(c_InAnaSigAdcCfg_ae[f_signal_e].adc_e,
                                             c_InAnaSigAdcCfg_ae[f_signal_e].adcChannel_e,
                                             FMKCDA_ADC_CFG_SCAN_DMA);

            if (Ret_e == RC_OK)
            { // update info
                g_InAnaSigInfo_as[f_signal_e].IsSigConfigured_b = (t_bool)True;
                g_InAnaSigInfo_as[f_signal_e].pull_e = f_pull_e;
                g_InAnaSigInfo_as[f_signal_e].spd_e = FMKIO_SPD_MODE_LOW;
            }
        }
    }
    return Ret_e;
}

/*********************************
 * FMKIO_Set_InFreqSigCfg
 *********************************/
t_eReturnState FMKIO_Set_InFreqSigCfg(t_eFMKIO_InFreqSig f_signal_e)
{
    t_eReturnState Ret_e = RC_OK;
    t_eFMKIO_GpioPort gpioPort_e;
    t_sFMKCPU_BspTimerCfg timerCfg_s;

    if (f_signal_e > FMKIO_INPUT_SIGFREQ_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if (Ret_e == RC_OK)
    {
        gpioPort_e = c_InFreqSigBspMap_as[f_signal_e].BasicCfg.HwGpio_e;
        Ret_e = s_FMKIO_Set_BspSigCfg(gpioPort_e,
                                      c_InFreqSigBspMap_as[f_signal_e].BasicCfg.HwPin_e,
                                      (t_uint32)GPIO_MODE_AF_PP,
                                      FMKIO_PULL_MODE_UNABLE,
                                      FMKIO_SPD_MODE_HIGH, // irrevelent for a input sig dig
                                      c_InFreqSigBspMap_as[f_signal_e].BspAlternateFunc_u8);
        if (Ret_e == RC_OK)
        {
            timerCfg_s.timer_e = c_InFreqSigBspMap_as[f_signal_e].timer_e;
            timerCfg_s.channel_e = c_InFreqSigBspMap_as[f_signal_e].channel_e;
            Ret_e = FMKCPU_Set_ICChannelCfg(timerCfg_s, FMKCPU_CHNL_MEAS_RISING_EDGE);
            if (Ret_e == RC_OK)
            {
                Ret_e = FMKCPU_AddTimerChnlCallback(timerCfg_s.timer_e,
                                                    timerCfg_s.channel_e,
                                                    (t_cbFMKCPU_InterruptChnl *)&s_FMKIO_MngSigFrequency);
            }
            if (Ret_e == RC_OK)
            { // update info
                g_InFreqSigInfo_as[f_signal_e].IsSigConfigured_b = (t_bool)True;
                g_InFreqSigInfo_as[f_signal_e].pull_e = FMKIO_PULL_MODE_UNABLE;
                g_InFreqSigInfo_as[f_signal_e].spd_e = FMKIO_SPD_MODE_HIGH;
            }
        }
    }
    return Ret_e;
}
/*********************************
 * FMKIO_Set_InEvntSigCfg
 *********************************/
t_eReturnState FMKIO_Set_InEvntSigCfg(t_eFMKIO_InEvntSig f_signal_e,
                                      t_eFMKIO_PullMode f_pull_e,
                                      t_eFMKIO_SigTrigCptr f_trigger_e,
                                      t_cbFMKIO_EventFunc *f_Evnt_cb)
{
    t_eReturnState Ret_e = RC_OK;
    t_eFMKIO_GpioPort gpioPort_e;
    t_uint32 bspTrigger_u32;

