mbarbeau0545/Stm32PrjTpl/src/1_FMK/FMK_HAL/FKM_IO/Src/FMK_IO.c
    if (f_signal_e > FMKIO_INPUT_SIGEVNT_NB || f_pull_e > FMKIO_PULL_MODE_NB || f_trigger_e > FMKIO_STC_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if (f_Evnt_cb == (t_cbFMKIO_EventFunc *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if (Ret_e == RC_OK)
    {
        gpioPort_e = c_InEvntSigBspMap_as[f_signal_e].BasicCfg.HwGpio_e;
        Ret_e = s_FMKIO_Get_BspTriggerMode(f_trigger_e, &bspTrigger_u32);
        if (Ret_e == RC_OK)
        {
            Ret_e = s_FMKIO_Set_BspSigCfg(gpioPort_e,
                                          c_InEvntSigBspMap_as[f_signal_e].BasicCfg.HwPin_e,
                                          (t_uint32)bspTrigger_u32,
                                          FMKIO_PULL_MODE_UNABLE,
                                          FMKIO_SPD_MODE_LOW, // irrevelent for a input sig dig
                                          c_InFreqSigBspMap_as[f_signal_e].BspAlternateFunc_u8);
            if (Ret_e == RC_OK)
            {

                Ret_e = FMKCPU_Set_NVICState(c_InEvntSigBspMap_as[f_signal_e].ExtiIRQN_e,
                                             FMKCPU_NVIC_PRIORITY_MEDIUM,
                                             FMKCPU_NVIC_OPE_ENABLE);
                if (Ret_e == RC_OK)
                { // update info
                    g_InEvntSigInfo_as[f_signal_e].IsSigConfigured_b = (t_bool)True;
                    g_InEvntSigInfo_as[f_signal_e].pull_e = FMKIO_PULL_MODE_UNABLE;
                    g_InEvntSigInfo_as[f_signal_e].spd_e = FMKIO_SPD_MODE_LOW;
                    g_InEvntSigInfo_as[f_signal_e].EvntFunc_cb = f_Evnt_cb;
                }
            }
        }
    }
    return Ret_e;
}
/*********************************
 * FMKIO_Set_OutPwmSigCfg
 *********************************/
t_eReturnState FMKIO_Set_OutPwmSigCfg(t_eFMKIO_OutPwmSig f_signal_e,
                                      t_eFMKIO_PullMode f_pull_e,
                                      t_uint32 f_frequency_u32,
                                      t_uint16 f_dutyCycle_u16,
                                      t_bool f_startNow_b)
{
    t_eReturnState Ret_e = RC_OK;
    t_eFMKIO_GpioPort gpioPort_e;
    t_sFMKCPU_BspTimerCfg timerCfg_s;

    if (f_signal_e > FMKIO_OUTPUT_SIGPWM_NB || f_pull_e > FMKIO_PULL_MODE_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if (Ret_e == RC_OK)
    {
        timerCfg_s.timer_e = c_OutPwmSigBspMap_as[f_signal_e].timer_e;
        timerCfg_s.channel_e = c_OutPwmSigBspMap_as[f_signal_e].channel_e;
        Ret_e = FMKCPU_Set_PWMChannelCfg(timerCfg_s, f_frequency_u32);

        if (Ret_e == RC_OK && f_startNow_b == (t_bool)True)
        {
            Ret_e = FMKCPU_Set_PWMChannelDuty(timerCfg_s.timer_e,
                                                timerCfg_s.channel_e,
                                                f_dutyCycle_u16);
        }
        
        if (Ret_e == RC_OK)
        {
            gpioPort_e = c_OutPwmSigBspMap_as[f_signal_e].BasicCfg.HwGpio_e;
            Ret_e = s_FMKIO_Set_BspSigCfg(gpioPort_e,
                                      c_OutPwmSigBspMap_as[f_signal_e].BasicCfg.HwPin_e,
                                      (t_uint32)GPIO_MODE_AF_PP,
                                      f_pull_e,
                                      FMKIO_SPD_MODE_LOW, // irrevelent for a input sig dig
                                      c_OutPwmSigBspMap_as[f_signal_e].BspAlternateFunc_u8);
            
            if (Ret_e == RC_OK)
            { // update info
                g_OutPwmSigInfo_as[f_signal_e].IsSigConfigured_b = (t_bool)True;
                g_OutPwmSigInfo_as[f_signal_e].pull_e = f_pull_e;
                g_OutPwmSigInfo_as[f_signal_e].spd_e = FMKIO_SPD_MODE_LOW;
            }
        }
    }
    return Ret_e;
}

/*********************************
 * FMKIO_Set_OutDigSigCfg
 *********************************/
t_eReturnState FMKIO_Set_OutDigSigCfg(t_eFMKIO_OutDigSig f_signal_e,
                                      t_eFMKIO_PullMode f_pull_e,
                                      t_eFMKIO_SpdMode f_spd_e)
{
    t_eReturnState Ret_e = RC_OK;
    t_eFMKIO_GpioPort gpioPort_e;

    if (f_signal_e > FMKIO_OUTPUT_SIGDIG_NB || f_pull_e > FMKIO_PULL_MODE_NB || f_spd_e > FMKIO_SPD_MODE_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if (Ret_e == RC_OK)
    {
        gpioPort_e = c_OutDigSigBspMap_as[f_signal_e].HwGpio_e;

        Ret_e = s_FMKIO_Set_BspSigCfg(gpioPort_e,
                                      c_OutDigSigBspMap_as[f_signal_e].HwPin_e,
                                      (t_uint32)GPIO_MODE_OUTPUT_PP,
                                      f_pull_e,
                                      f_spd_e,
                                      FMKIO_AF_UNUSED);
        if (Ret_e == RC_OK)
        {
            g_OutDigSigInfo_as[f_signal_e].IsSigConfigured_b = (t_bool)True;
            g_OutDigSigInfo_as[f_signal_e].pull_e = f_pull_e;
            g_OutDigSigInfo_as[f_signal_e].spd_e = f_spd_e;
        }
    }
    return Ret_e;
}

/*********************************
 * FMKIO_Set_OutDigSigValue
 *********************************/
t_eReturnState FMKIO_Set_OutDigSigValue(t_eFMKIO_OutDigSig f_signal_e, t_eFMKIO_DigValue f_value_e)
{
    t_eReturnState Ret_e = RC_OK;
    GPIO_TypeDef *bspGpio_ps = (GPIO_TypeDef *)NULL;
    GPIO_PinState bspSigValue_e;

    if (f_signal_e > FMKIO_OUTPUT_SIGDIG_NB || f_value_e > FMKIO_DIG_VALUE_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if (Ret_e == RC_OK)
    {
        Ret_e = s_FMKIO_Get_BspGpioPort(c_OutDigSigBspMap_as[f_signal_e].HwGpio_e, &bspGpio_ps);
        if (Ret_e == RC_OK)
        {
            switch (f_value_e)
            {
            case FMKIO_DIG_VALUE_LOW:
                bspSigValue_e = GPIO_PIN_RESET;
                break;
            case FMKIO_DIG_VALUE_HIGH:
                bspSigValue_e = GPIO_PIN_SET;
                break;
            case FMKIO_DIG_VALUE_NB:
            default:
                Ret_e = RC_WARNING_WRONG_RESULT;
                break;
            }
            if (Ret_e == RC_OK)
            {
                HAL_GPIO_WritePin(bspGpio_ps,
                                  c_BspPinMapping_ua32[c_OutDigSigBspMap_as[f_signal_e].HwPin_e],
                                  bspSigValue_e);
            }
        }
    }
    return Ret_e;
}
/*********************************
 * FMKIO_Set_OutPwmSigValue
 *********************************/
t_eReturnState FMKIO_Set_OutPwmSigValue(t_eFMKIO_OutPwmSig f_signal_e, t_uint16 f_dutyCycle_u16)
{
    t_eReturnState Ret_e = RC_OK;

